# SQL复习笔记

VS code 连接 mysql 注意了！mssql 插件不支持 mysql，需要下载其他插件才能用！

In [1]:
import pymysql

In [7]:
conn = pymysql.connect(host="localhost", user="root", password="123456")
cursor = conn.cursor()

In [41]:
cursor.execute('show databases;')
print( cursor.fetchall())

(('information_schema',), ('mysql',), ('performance_schema',), ('sakila',), ('sys',), ('world',))

可以正常运行了！

## 1.操作数据库

创建数据库：CREATE DATABASE [IF NOT EXISTS] mydb1;
- 例如：CREATE DATABASE mydb1，创建一个名为 mydb1 的数据库。如果这个数据已经存在，那么会报错。
- CREATE DATABASE IF NOT EXISTS mydb1，在名为 mydb1 的数据库不存在时创建该库，这样可以避免报错。

删除数据库：DROP DATABASE [IF EXISTS] mydb1;

## 2.数据类型

- int：整型
- double：浮点型，例如 double(5,2)表示最多 5 位，其中必须有 2 位小数，即最大值为 999.99；
- decimal：泛型型，在表单线方面使用该类型，因为不会出现精度缺失问题；
- char：固定长度字符串类型；(当输入的字符不够长度时会补空格)
- varchar：固定长度字符串类型；
- text：字符串类型；
- blob：字节类型；
- date：日期类型，格式为：yyyy-MM-dd；
- time：时间类型，格式为：hh:mm:ss；
- timestamp：时间戳类型；

## 3.操作表

创建表
- CREATE TABLE 表名(列名 列类型 [not null] [primary key], 列名 列类型,...... );

根据已有的表创建新表
- create table 新表 like 旧表
- create table 新表 as select 列1,列2 … from 旧表 definition only

查看表的结构
- DESC 表名;

删除表
- DROP TABLE 表名;

修改表
- 添加列：给 stu 表添加 classname 列
    - ALTER TABLE stu ADD (classname varchar(100));
- 修改列的数据类型：修改 stu 表的 gender 列类型为 CHAR(2)
    - ALTER TABLE stu MODIFY gender CHAR(2);
- 修改列名：修改 stu 表的 gender 列名为 sex
    - ALTER TABLE stu change gender sex CHAR(2);
- 删除列：删除 stu 表的 classname 列
    - ALTER TABLE stu DROP classname;
- 修改表名称：修改 stu 表名称为 student
    - ALTER TABLE stu RENAME TO student;
    
添加主键
- Alter table tabname add primary key(col)

删除主键 
- Alter table tabname drop primary key(col)

创建索引
- create [unique] index idxname on tabname(col…)

删除索引
- drop index idxname

## 4.插入数据

语法 1：INSERT INTO 表名(列名 1,列名 2, …) VALUES(值 1,值 2,…);

语法 2：INSERT INTO 表名 VALUES(值 1,值 2,…);
- 因为没有指定要插入的列，表示按创建表时列的顺序插入所有列的值：

## 5.修改数据

UPDATE 表名 SET 列名 1=值 1, … 列名 n=值 n [WHERE 条件];

## 6.删除数据

语法 1：DELETE FROM 表名 [WHERE 条件];

语法 2：TRUNCATE TABLE 表名;

两者之间的区别：

虽然 TRUNCATE 和 DELETE 都可以删除表的所有记录，但有原理不同。DELETE的效率没有 TRUNCATE 高！
TRUNCATE 其实属性 DDL 语句，因为它是先 DROP TABLE，再 CREATE TABLE。
而且TRUNCATE删除的记录是无法回滚的，但DELETE删除的记录是可以回滚的。

## 7.数据查询语言

基础查询：
- SELECT 列名 1, 列名 2, … 列名 n FROM 表名;

条件查询：
- SELECT 列名 FROM 表名 WHERE …;
    - =、!=、<>、<、<=、>、>=；
    - BETWEEN…AND；
    - IN(set)；
    - IS NULL；
    - AND；
    - OR；
    - NOT；
    
模糊查询：
- SELECT 字段 FROM 表 WHERE 某字段 Like 条件
    - % ：表示任意 0 个或多个字符。可匹配任意类型和长度的字符，有些情况下若是中文，请使用两个百分号（%%）表示。
    - _： 表示任意单个字符。匹配单个任意字符，它常用来限制表达式的字 符长度语句。
    
字段控制查询：
- 去除重复：SELECT DISTINCT 列名 FROM 表名;
- SELECT 列1+IFNULL(列2,0) AS 新列名 FROM 表名;
    - IFNULL(列2,0) 把 NULL 转换成数值 0：

排序查询：
- SELECT * FROM 表名 ORDER BY 列1 DESC ,列2 ASC;
    - 如果列1相同则看列2
    - DESC 降序
    - ASC 升序
    
聚合函数：
- SELECT 聚合函数(列名) AS 新列名 FROM 表名;
    - COUNT()：统计指定列不为 NULL 的记录行数；
    - MAX()：计算指定列的最大值，如果指定列是字符串类型，那么使用字符串排序运算；
    - MIN()：计算指定列的最小值，如果指定列是字符串类型，那么使用字符串排序运算；
    - SUM()：计算指定列的数值和，如果指定列类型不是数值类型，那么计算结果为 0；
    - AVG()：计算指定列的平均值，如果指定列类型不是数值类型，那么计算结果为 0；
    
分组查询：
- SELECT SUM(列名) FROM 表名 GROUP BY 分类列名 HAVING SUM(列名) > 100;
    - 注意，WHERE 是对分组前记录的条件，如果某行记录没有满足 WHERE 子句的条件，那么这行记录不会参加分组；而 HAVING 是对分组后数据的约束。

限定查询结果的起始行，以及总行数：
- SELECT * FROM 表名 LIMIT 3, 10;
    - 查询 10 行记录，起始行从 3 开始。
    
多表连接查询：
- 内连接：select 表1.name,列名 from 表1,表2 where 表1.name=表2.name;
- 外连接：select 表1.name,列名 from 表1 [left/right] [out/inner] join 表2 on 表1.name=表2.name;

几个高级查询运算词
- UNION 运算符：通过组合其他两个结果表（例如 TABLE1 和 TABLE2）并消去表中任何重复行而派生出一个结果表。当 ALL 随 UNION 一起使用时（即 UNION ALL），不消除重复行。两种情况下，派生表的每一行不是来自 TABLE1 就是来自 TABLE2。
- EXCEPT 运算符：通过包括所有在 TABLE1 中但不在 TABLE2 中的行并消除所有重复行而派生出一个结果表。当 ALL 随 EXCEPT 一起使用时 (EXCEPT ALL)，不消除重复行。
- INTERSECT 运算符：通过只包括 TABLE1 和 TABLE2 中都有的行并消除所有重复行而派生出一个结果表。当 ALL 随 INTERSECT 一起使用时 (INTERSECT ALL)，不消除重复行。

## 8.Python实践

In [45]:
import pandas as pd

In [47]:
cursor.execute('use world;')

0

In [49]:
sql_1 = "SELECT * from city" #利用pandas直接获取数据"
data = pd.read_sql(sql_1, conn)

In [50]:
data.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [83]:
cursor.execute('CREATE TABLE ttable(name text,age int,info text);')

0

In [84]:
addt = "insert into ttable(name,age,info) values(%s,%r,%s)"
li=[('achlier',30,'ImNobody')]

In [85]:
cursor.executemany(addt, li)
conn.commit()

In [86]:
cursor.close()
conn.close()

## References
- [史上最全SQL基础知识总结(理论+举例)](https://blog.csdn.net/m0_67402026/article/details/125389578)
- [MySql 语法（完整版）](https://blog.csdn.net/babylovewei/article/details/103763546)
- [教你怎么用python连接sql server](https://www.jb51.net/article/212497.htm)
- [python操作sql数据库](https://blog.csdn.net/duxinyuhi/article/details/123891326)